In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.18517376,  0.66242935,  1.0889344 ],
       [ 1.99453388,  1.63329276,  0.14676762],
       [ 0.28431508, -0.01513223,  1.13377965],
       [-0.16121345, -0.57797772,  2.41660602]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0 -0.185174  0.662429  1.088934
1  1.994534  1.633293  0.146768
2  0.284315 -0.015132  1.133780
3 -0.161213 -0.577978  2.416606

In [6]:
type(dataFrame[0])

pandas.core.series.Series

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Şule","Hasan","Atıl","Mustafa"],columns=["yas","maas","calisma saati"])

In [8]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [9]:
yeniDataFrame["yas"]

Şule      -0.185174
Hasan      1.994534
Atıl       0.284315
Mustafa   -0.161213
Name: yas, dtype: float64

In [10]:
yeniDataFrame["calisma saati"]

Şule       1.088934
Hasan      0.146768
Atıl       1.133780
Mustafa    2.416606
Name: calisma saati, dtype: float64

In [12]:
yeniDataFrame[["maas","calisma saati"]]

             maas  calisma saati
Şule     0.662429       1.088934
Hasan    1.633293       0.146768
Atıl    -0.015132       1.133780
Mustafa -0.577978       2.416606

In [13]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [17]:
yeniDataFrame.loc["Şule"]

yas             -0.185174
maas             0.662429
calisma saati    1.088934
Name: Şule, dtype: float64

In [18]:
yeniDataFrame.iloc[:1, :]

           yas      maas  calisma saati
Şule -0.185174  0.662429       1.088934

In [21]:
# kolon ekleme

yeniDataFrame["emeklilik"] = yeniDataFrame["yas"] *2

In [22]:
yeniDataFrame

              yas      maas  calisma saati  emeklilik
Şule    -0.185174  0.662429       1.088934  -0.370348
Hasan    1.994534  1.633293       0.146768   3.989068
Atıl     0.284315 -0.015132       1.133780   0.568630
Mustafa -0.161213 -0.577978       2.416606  -0.322427

In [24]:
# sutun silme
yeniDataFrame.drop("emeklilik",axis=1)

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [25]:
yeniDataFrame

              yas      maas  calisma saati  emeklilik
Şule    -0.185174  0.662429       1.088934  -0.370348
Hasan    1.994534  1.633293       0.146768   3.989068
Atıl     0.284315 -0.015132       1.133780   0.568630
Mustafa -0.161213 -0.577978       2.416606  -0.322427

In [26]:
#sutunu tamamen silmek için inplace=True olmalı.
yeniDataFrame.drop("emeklilik",axis=1,inplace=True)

In [27]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [29]:
yeniDataFrame.loc["Şule","yas"]

-0.1851737611442744

In [30]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [31]:
boolenFrame = yeniDataFrame < 0

In [32]:
boolenFrame

           yas   maas  calisma saati
Şule      True  False          False
Hasan    False  False          False
Atıl     False   True          False
Mustafa   True   True          False

In [33]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [34]:
yeniDataFrame[boolenFrame]

              yas      maas  calisma saati
Şule    -0.185174       NaN            NaN
Hasan         NaN       NaN            NaN
Atıl          NaN -0.015132            NaN
Mustafa -0.161213 -0.577978            NaN

In [35]:
yeniDataFrame[yeniDataFrame < 0 ]

              yas      maas  calisma saati
Şule    -0.185174       NaN            NaN
Hasan         NaN       NaN            NaN
Atıl          NaN -0.015132            NaN
Mustafa -0.161213 -0.577978            NaN

In [36]:
yeniDataFrame[yeniDataFrame["maas"] > 0]

            yas      maas  calisma saati
Şule  -0.185174  0.662429       1.088934
Hasan  1.994534  1.633293       0.146768

In [37]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [39]:
# isim indexlerinin yanına yeniden index vermke için reset_index kullanılır.
yeniDataFrame.reset_index()

     index       yas      maas  calisma saati
0     Şule -0.185174  0.662429       1.088934
1    Hasan  1.994534  1.633293       0.146768
2     Atıl  0.284315 -0.015132       1.133780
3  Mustafa -0.161213 -0.577978       2.416606

In [40]:
yeniDataFrame

              yas      maas  calisma saati
Şule    -0.185174  0.662429       1.088934
Hasan    1.994534  1.633293       0.146768
Atıl     0.284315 -0.015132       1.133780
Mustafa -0.161213 -0.577978       2.416606

In [41]:
yeniIndexListesi = ["Şu","Ha","At","Mu"]

In [42]:
yeniDataFrame["yeni_index"] = yeniIndexListesi

In [43]:
yeniDataFrame

              yas      maas  calisma saati yeni_index
Şule    -0.185174  0.662429       1.088934         Şu
Hasan    1.994534  1.633293       0.146768         Ha
Atıl     0.284315 -0.015132       1.133780         At
Mustafa -0.161213 -0.577978       2.416606         Mu

In [45]:
yeniDataFrame.set_index("yeni_index")

                 yas      maas  calisma saati
yeni_index
Şu         -0.185174  0.662429       1.088934
Ha          1.994534  1.633293       0.146768
At          0.284315 -0.015132       1.133780
Mu         -0.161213 -0.577978       2.416606

In [46]:
yeniDataFrame

              yas      maas  calisma saati yeni_index
Şule    -0.185174  0.662429       1.088934         Şu
Hasan    1.994534  1.633293       0.146768         Ha
Atıl     0.284315 -0.015132       1.133780         At
Mustafa -0.161213 -0.577978       2.416606         Mu

In [47]:
yeniDataFrame.set_index("yeni_index",inplace=True)

In [48]:
yeniDataFrame

                 yas      maas  calisma saati
yeni_index
Şu         -0.185174  0.662429       1.088934
Ha          1.994534  1.633293       0.146768
At          0.284315 -0.015132       1.133780
Mu         -0.161213 -0.577978       2.416606

In [49]:
yeniDataFrame.loc["Şu"]

yas             -0.185174
maas             0.662429
calisma saati    1.088934
Name: Şu, dtype: float64

In [51]:
yeniDataFrame.iloc[:1, :]

                 yas      maas  calisma saati
yeni_index
Şu         -0.185174  0.662429       1.088934

In [52]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [53]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [54]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [55]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [56]:
cizgiFilmDataFrame = pd.DataFrame(benimCizgiFilmListem,index=birlesmisIndeks,columns=["Yas", "Meslek"])

In [57]:
cizgiFilmDataFrame

                    Yas Meslek
Simpson    Homer     40      A
           Bart      10      B
           Marge     30      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F

In [58]:
cizgiFilmDataFrame.loc["Simpson"]

       Yas Meslek
Homer   40      A
Bart    10      B
Marge   30      C

In [63]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [64]:
cizgiFilmDataFrame

                    Yas Meslek
Film Adı   İsim
Simpson    Homer     40      A
           Bart      10      B
           Marge     30      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F